RabbitMQ - это брокер сообщений с открытым исходным кодом.
Кратко работу RabbitMQ можно описать следущим образом:
Издатель отправляет сообщение определенному обменнику;
Обменник, получив сообщение, маршрутизирует его в одну и несколько очередей в
соответствиис правилами привязки между ним и очередью;
Очередь хранит ссылку на это сообщение. Само сообщение хранится в оперативной
памяти ии на диске;
Как только потребитель готов получить сообщение из очереди, сервер создаёт
копию сообщения по ссылке и отправляет;
Потребитель получает сообщение и отправляет брокеру подтверждение;
Брокер, получив подтверждение, удаляет копию сообщения в очереди. Затем
удаляет из оперативной памяти и с диска.

MQ - Message Queue.
